
import re
import unicodedata
from ats_module.text_preprocessing import *
nk = Nickonlpy(base=False)

def process_text(text):
    # 정규표현식 패턴을 사용하여 괄호 안의 글자를 추출합니다.
    pattern = r'[(（](.*?)[)）]'
    matches = re.findall(pattern, text)

    # 2글자 이상인 경우 특수문자를 제거하여 반환합니다.
    for match in matches:
        if len(match) != 1:
            # 특수문자를 제거합니다. (알파벳과 숫자만 남깁니다.)
            text = text.replace("(", "")
            text = text.replace("（", "")
            text = text.replace(")", "")
            text = text.replace("）", "")
    text = text.replace(" ", "0")
    text = text.replace("　", "0")

    return text

def convert_fullwidth_to_halfwidth(text):
    return ''.join(unicodedata.normalize('NFKC', c) for c in text)

def del_sw(text, delete_num=True):
    # 전각을 모두 반각으로
    text = convert_fullwidth_to_halfwidth(text)
    text = text.replace("(주", " 주 ")
    text = text.replace("주)", " 주 ")
    text = text.replace("㈜", " 주 ")
    
    text = re.sub(r'[^\w\s]', ' ', text)
    text = text.replace('_', ' ')

    text = text.replace(" 주 ", "(주)")
    text = text.replace(" 유 ", "(유)")
    text = text.replace(" 학 ", "(학)")
    text = text.replace(" 복 ", "(복)")
    text = text.replace(" 재 ", "(재)")
    text = text.replace(" 의 ", "(의)")
    text = text.replace(" 합 ", "(합)")
    text = text.replace(" 사 ", "(사)")

    text = text.strip()
    if delete_num:
        for key, value in unit_dict.items():
            text = text.replace(key, " %s "%value)
        text = " ".join(text.split("0"))
    return text


def find_name(text):
    
    # 정규표현식을 사용하여 특수문자를 제거합니다.
    result = re.sub(r'[^\w\s]', ' ', text)
    result = [i[0] for i in nk.post.pos(result) if i[1] == 'Name']
    return result


def check_language(input_str):
    korean_pattern = re.compile(r'^[가-힣\s]+$')  # 한글 및 공백 문자만 포함하는 정규 표현식
    english_pattern = re.compile(r'^[A-Za-z\s]+$')  # 영어 및 공백 문자만 포함하는 정규 표현식
    
    if korean_pattern.match(input_str):
        return True
    elif english_pattern.match(input_str):
        return False
    else:
        return False
    
    
place = ["제주", "전북", "경남", "한국", "부산", "광주", "대구"]
securities = ["고수익", "채권혼", "채권", "주식", "증권", "증권자", "증권", "특별자산", "산업", "투자", \
            "배당증", "배당", "채혼", "인덱스", "금융", "연금", "소득공제", "개인연금", "본토"]
comp_word_for_contains = "|".join(["급여", "월급", "월급여", "상여금", "상여", "성과급", "성과", "인센티브", "식대", \
                                    "가족수당"])
save_word_for_contains = "|".join(["주택청약금", "주택청약", "청약", "저축", "적금"])
ede_word_for_contains = "|".join(["교육비", "방과후", "학원비", "학습비", "등록금", "학비", \
                                    "기숙사비", "교과서비", "석식비", "재료비", "급식비", \
                                    "교재비", "하복비", "체험비", "체육복비", "수강료"])
insu_word_for_contains = "|".join(["화재보험료", "종신보험료", "연금보험", "종신보험", "암보험", "건강보험", \
                                "실비보험", "운전자보험", "손해보험", "보험료", "보험비", "보험"])
resi_word_for_contains = "|".join(["전세금", "전세", "관리비", "월세"])
loan_word_for_contains = "|".join(["대출이자", "이자", "대출"])
indi_word_for_contains = "|".join(["가족", "엄마", "아빠", "모임", "어머니", "아버지", \
                                   "누나", "동생", "용돈", "생활비", "곗돈", "장모님", "회비", "친정", "계돈"])
goal_word_for_contains = "|".join(["축하금", "장려금", "포상금", "퇴직금", "정산금", "교부금", "할부금", \
                                    "한국전자금", "성과금", "등록금", "보조금", "격려금", "환불금", "증거금", \
                                    "후원금", "경조금", "회수금", "시상금", "기부금", "비상금", "분배금", \
                                    "학자금", "보증금", "배당금", "대여금", "지원금", "전도금", "지급금", \
                                    "예치금", "일시금", "환급금", "초과금", "추가금", "현금", "양도금", \
                                    "수익금", "상환금", "반환금", "보험금", "방송헌금", "헌금", "전별금", \
                                    "입학금", "예치금", "대출금", "건축금", "정착금", "연차금", "복지금", \
                                    "공제금", "적금", "저금", "축의금", "조의금", "사은금", "공과금", "잔금", \
                                    "지원금", "대부금", "적립금", "원리금", "위로금", "사례금", "배려금", \
                                    "충당금", "부담금", "추납금", "상납금", "반납금", "공납금", "보관금", \
                                    "출금", "부의금", "부원금", "예수금", "보상금", "특별금", "임대금",  \
                                    "교무금", "협력금", "자금", "납입금", "선입금", "임금", "분납금", \
                                    "주택부금", "세금", "의무금", "공동모금"])
fare_word_for_contains = "|".join(["수수료", "전화료", "간호료", "전형료", "보험료", "통행료", "렌탈료", \
                                    "위탁료", "임차료", "보증료", "연주료", "조정료", "월정료", "과재료", \
                                    "기장료", "저작료", "위자료", "수임료", "할인료", "강의료", "이용료", \
                                    "사용료", "강연료", "용역료", "대여료", "수업료", "통신료", "강습료", \
                                    "기술료", "보수료", "운송료", "심사료", "봉사료", "강사료", "자문료", \
                                    "판독료", "구독료", "수도료", "임대료", "배달료", "전기료", "급료", \
                                    "광고료", "원고료", "수고료", "지입료"])
cost_word_for_contains = "|".join(["활동비", "참가비", "특강비", "소개비", "자개비", "중개비", "인건비", \
                                    "파견비", "가계비", "계비", "수고비", "가공비", "판공비", "방과비", \
                                    "퇴교비", "학교비", "연구비", "탐구비", "의국비", "대근비", "특근비", \
                                    "발급비", "환급비", "노조비", "대기비", "동기비", "실기비", "안테나비", \
                                    "진단비", "당비", "식대비", "임대비", "접대비", "태권도비", "기도비", \
                                    "효도비", "감독비", "활동비", "카드비", "급량비", "차량비", "체력단련비", \
                                    "수련비", "체련비", "훈련비", "사례비", "월례비", "차례비", "등록비",  \
                                    "음료비", "의료비", "진료비", "치료비", "분류비", "유류비", "복리비", \
                                    "수리비", "처리비", "볼링비", "거마비", "가맹비", "노무비", "업무비", \
                                    "선물비", "숙박비", "운반비", "일반비", "자기계발비", "능력계발비", \
                                    "자기개발비", "심방비", "택배비", "페스티벌비", "앨범비", "학사비", \
                                    "교복비", "피복비", "돌봄비", "케이블비", "예비비", "강사비", "검사비", \
                                    "교사비", "심사비", "경조사비", "조사비", "경상비", "보상비", "성상비", \
                                    "복리후생비", "참석비", "개선비", "귀성비", "프로모션비", "숙소비", \
                                    "청소비", "배송비", "운송비", "인쇄비", "교수비", "연수비", "접수비", \
                                    "기숙비", "가스비", "버스비", "헬스비", "택시비",  "보안비", "대여비", \
                                    "급양비", "요양비", "부업비", "수업비", "영업비", "작업비", "잔업비", \
                                    "참여비", "여비", "용역비", "운영비", "촬영비", "예비", "과외비", "학운비", \
                                    "병원비", "지원비", "유치원비", "회원비", "원비", "간식비", "특근매식비", \
                                    "숙식비", "야식비", "조식비", "중식비", "특식비", "회식비", "식비", "우유비", \
                                    "양육비", "강의비", "심의비", "회의비", "개인비", "일비", "모임비", \
                                    "운임비", "구입비", "사입비", "잡비", "출장비", "팀장비", "현장비", \
                                    "주재비", "체재비", "취재비", "운전비", "명절비", "면접비", "고정비", \
                                    "교제비", "경조비", "노조비", "보조비", "외주비", "계중비", "복지비", \
                                    "유지비", "당직비", "숙직비", "일직비", "건강검진비", "사진비", "체력증진비", \
                                    "촉진비", "추진비", "승차비", "연차비", "주차비", "차비", "명찰비", "시책비", \
                                    "창체비", "판촉비", "조출비", "지출비", "파출비", "보충비", "콜비", "세탁비", \
                                    "렌탈비", "파트비", "팀비", "휴대폰비", "기념품비", "소모품비", "사은품비", \
                                    "캠프비", "샘플비", "조합비", "수행비", "여행비", "차량운행비", "진행비", \
                                    "귀향비", "보험비", "특성화비", "전공심화비", "전화비", "문화생활비", "생활비", \
                                    "영활비", "연회비", "후원회비", "야유회비", "협의회비", "모임회비", "상조회비", \
                                    "교통회비", "동창회비", "회비", "방과후비", "교통비", "알바비", "휴가비", \
                                    "교통비", "통신비", "관리비", "개인경비", "경비", "외근비", "야근비", "지도비", \
                                    "사무실비", "통근비", "영어비", "선교비"])

grou_word_for_contains = "|".join(["대의원회", "성가회", "가회", "동갑회", "성서공회", "성공회", "박물관회", "연구회", \
                                    "돕기회", "동기회", "하나회", "수년회", "아녀회", "청소년회", "청년회", "기념회", \
                                    "수도노회", "나눔회", "소담회", "상당회", "수도회", "사랑회", "수련회", "장로회", \
                                    "섭리회", "만만회", "열매회", "자매회", "신명회", "부모회", "친목회", "총동문회", \
                                    "동문회", "농민회", "시민회", "봉사회", "지역사회", "이용사회", "의사회", "종합사회", \
                                    "간호사회", "변호사회", "사회", "여성회", "계승회", "낚시회", "지심회", "밀알회", \
                                    "중앙회", "사업회", "번영회", "운영회", "검우회", "교우회", "동우회", "사우회", \
                                    "시우회", "양우회", "연우회", "영우회", "오우회", "통우회", "향우회", "환우회", \
                                    "위원회", "의원회", "후원회", "보육회", "체육회", "새마을회", "마을회", "협의회", \
                                    "의회", "상인회", "모임회", "책임회", "노동자회", "보전회", "안전회", "공제회", \
                                    "상조회", "보존회", "대종회", "복지회", "지회", "세진회", "월진회", "총동창회", \
                                    "동창회", "국청회", "정기총회", "총회", "자치회", "은친회", "과학회", "의학회", \
                                    "장학회", "학회", "연합회", "선행회", "동호회", "정호회", "진흥회", "수녀회", \
                                    "모금회", "숭모회"])

# ede_word = ["교과서비", "석식비", "재료비", "급식비", "교재비", "하복비", "체험비", "체육복비"]

bank_dict={
           "새마을":"새마을금고",
           "ＫＢ손보":"KB손해보험",
           "ＫＢ손":"KB손해보험",
           "ＫＢ생":"KB생명보험",
           "ＤＢ손보":"DB손해보험",
           "ＤＢ손":"DB손해보험",
           "미래에셋":"미래애셋증권",
           "금고":"새마을금고",
           "국민":"KB국민은행",
           "기업":"기업은행",
           "농협":"NH농협은행",
           "신한":"신한은행",
           "씨티":"한국씨티은행",
           "산업":"산업은행",
           "ＳＣ":"SC제일은행",
           "하나":"하나은행",
           "대신":"대신증권",
           "한화":"한화은행",
           "미래":"미래애셋증권",
           "우체":"우체국",
           "산림":"산림조합",
           "메츠":"메리츠",
           "부산":"부산은행",
           "대구":"대구은행",
           "경남":"경남은행",
           "광주":"광주은행",
           "대구":"대구은행",
           "전북":"전북은행",
           "제주":"제주은행",
           "한국":"한국은행",
           "카카":"카카오뱅크",
           "토뱅":"토스뱅크",
           "수협":"수협은행",
           "신협":"신협은행",
           "NH":"NH농협은행",
           "케이비":"KB국민은행",
           "ＮＨ":"NH농협은행",
           "KB":"KB국민은행",
           }

inco_comp_dict = {
                "유한회사": "유한회사",
                "재단법인": "재단법인",
                "주식회사": "주식회사",
                "사단법인": "사단법인",
                "의료법인": "의료법인",
                "학교법인": "학교법인",
                "합자회사": "합자회사",
                "복지재단": "복지재단",
                "（주": "주식회사",
                "(주": "주식회사",
                "주）": "주식회사",
                "주)": "주식회사",
                "（유）": "유한회사",
                "(유)": "유한회사",
                "（재）": "재단법인",
                "(재)": "재단법인",
                "（주）": "주식회사",
                "㈜": "주식회사",
                "(주)": "주식회사",
                "（사）": "사단법인",
                "(사)": "사단법인",
                "（의）": "의료법인",
                "(의)": "의료법인",
                "（학）": "학교법인",
                "(학)": "학교법인",
                "（합）": "합자회사",
                "(합)": "합자회사",
                "（복）": "복지재단",
                "(복)": "복지재단",
                }

stoc_dict = {"흥국":"흥국증권",
             "한화":"한화투자증권",
             "한투":"한국투자증권",
             "한국투자":"한국투자증권",
             "하이":"하이투자증권",
             "하나":"하나증권",
             "AB":"AB자산운용",
             "BNK":"BNK투자증권",
             "DB":"DB금융투자",
             "파델리티":"파델리티자산운용",
             "파인만":"파인만",
             "파워플러스":"파워플러스",
             "트러스톤":"트러스톤자산운용",
             "키움":"키움증권",
             "칸서스":"칸서스자산운용",
             "이스트스프링":"이스트스프링자산운용",
             "유진":"유진투자증권",
             "유리":"유리자산운용",
             "우리":"우리금융그룹",
             "에셋플러스":"에셋플러스자산운용",
             "신한":"신한투자증권",
             "신한":"신한투자증권",
             "신영":"신영증권",
             "슈로더":"슈로더자산운용",
             "삼성":"삼성증권",
             "브이아이":"브이아이자산운용",
             "베어링":"베어링자산운용",
             "미래에셋":"미래에셋증권",
             "미래":"미래에셋증권",
             "메리츠":"메리츠증권",
             "멀티에셋":"멀티에셋자산운용",
             "마이다스":"마이다스에셋자산운용",
             "대신":"대신증권",
             "다올":"다올투자증권",
             "교보악사":"교보악사자산운용",
             "NH":"NH투자증권",
             "KTB":"KTB투자증권",
             "KB":"KB증권",
             "IBK":"IBK투자증권",
             }


unit_dict = {"0월":"1월",
             "0년":"1월",
             "0회":"1월",
             "0일":"1월",
             "0만":"1월",
             "0분":"1월",
             "0호":"1월",
             "0층":"1월",
             "0月":"1월",
             "0주":"1월",
             "0차":"1월",
             "0동":"1월",
             "0기":"1월",
             "0세기":"1세기",
             "0째주":"첫째주",
             "1주 년":"1주년",
             "1분 기":"1분기",
             "1년 차":"1년차",
             "1년 도":"1년도",
             "1월 분":"1월분",
             "1년 분":"1년분",
            }

bank_dict_2 = {"국민":['국민은행','KB','Kb','국민'],
                "신한":['신한은행','신한'],
                "기업":['기업은행','기업',"IBK"],
                "농협":['농협은행','NH','nh','농협'],
                "금고":["새마을금고","새마을","금고"],
                "신협":["신협"],
                "씨티":["씨티은행"],
                "ＳＣ":["SC제일은행"],
                "SC":["SC제일은행"],
                "수협":["수협"],
                "하나":["하나"],
                "국고":["국고"],
                "대신":["대신증권"],
                "KB":["국민"],
                "산업":["산업"],
                "한화":["한화"],
                "삼성":["삼성"],
                "미래":["미래애셋증권"],
                "우체":["우체국"],
                "메츠":["메리츠"],
                "산림":["산림"],
                "대구":["대구"]
                }